JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = DUALTIMER :: Name = DUALTIMER0 -->
      <name>DUALTIMER0</name>
      <version>1.0.0</version>
      <description>ARM General Purpose Dual Timer</description>
      <groupName>DUALTIMER</groupName>
      <baseAddress>0x40001000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>TIMER1LOAD</name>
          <description>Timer 1 Load Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMER1VALUE</name>
          <description>Timer 1 Current Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMER1CONTROL</name>
          <description>Timer 1 Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>ONE_SHOT_COUNT</name>
              <description>Mode Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Wrapping Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>One-Shot Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMER_SIZE</name>
              <description>Timer Size</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>16-bit Counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>32-bit Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMERPRE</name>
              <description>Prescale Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0 Stages, Clock Divided by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>4 Stages, Clock Divided by 16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>8 Stages, Clock Divided by 256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Undefined, do not use</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RESERVED4</name>
              <description>Reserved bit do not use</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INTERRUPT_ENABLE</name>
              <description>Active High Interrupt Enable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMER_MODE</name>
              <description>Mode Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Free-Running Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Periodic Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMER_ENABLE</name>
              <description>Active High Timer Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMER1INTCLR</name>
          <description>Timer 1 Interrupt Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER1RIS</name>
          <description>Timer 1 Raw Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER1MIS</name>
          <description>Timer 1 Masked Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER1BGLOAD</name>
          <description>Timer 1 Background Load Register (Reload Value for Period Mode)</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMER2LOAD</name>
          <description>Timer 2 Load Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMER2VALUE</name>
          <description>Timer 2 Current Value Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMER2CONTROL</name>
          <description>Timer 2 Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>ONE_SHOT_COUNT</name>
              <description>Mode Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Wrapping Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>One-Shot Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMER_SIZE</name>
              <description>Timer Size</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>16-bit Counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>32-bit Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMERPRE</name>
              <description>Prescale Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0 Stages, Clock Divided by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>4 Stages, Clock Divided by 16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>8 Stages, Clock Divided by 256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Undefined, do not use</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RESERVED4</name>
              <description>Reserved bit do not use</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INTERRUPT_ENABLE</name>
              <description>Active High Interrupt Enable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMER_MODE</name>
              <description>Mode Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Free-Running Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Periodic Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TIMER_ENABLE</name>
              <description>Active High Timer Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMER2INTCLR</name>
          <description>Timer 2 Interrupt Clear Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER2RIS</name>
          <description>Timer 2 Raw Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER2MIS</name>
          <description>Timer 2 Masked Interrupt Status Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMER2BGLOAD</name>
          <description>Timer 2 Background Load Register (Reload Value for Period Mode)</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>

        <register>
          <name>TIMERITCR</name>
          <description>Integration Test Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>

        <register>
          <name>TIMERITOP</name>
          <description>Integration Test Output Set Register</description>
          <addressOffset>0xF04</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>INT_TEST_TIMINT1_VALUE</name>
              <description>Value Output on TIMINT1 in Integration Test Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>INT_TEST_TIMING2_VALUE</name>
              <description>Value Output on TIMINT2 in Integration Test Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPERIPHID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_C_CODE</name>
              <description>JEP106 C Code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK_COUNT</name>
              <description>Block Count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPERIPHID5</name>
          <description>Peripheral ID Register 5</description>
          <addressOffset>0xFD4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPERIPHID6</name>
          <description>Peripheral ID Register 6</description>
          <addressOffset>0xFD8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPERIPHID7</name>
          <description>Peripheral ID Register 7</description>
          <addressOffset>0xFDC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPERIPHID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0xFE0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x23</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 7:0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPERIPHID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0xFE4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB8</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 11:8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEP106_ID_3_0</name>
              <description>JEP106 ID Bits 3:0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPERIPHID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0xFE8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1B</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_ID_6_4</name>
              <description>JEP106 ID Bits 6:4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEDEC_USED</name>
              <description>JEDEC Used</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>REVISION</name>
              <description>Revision</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPERIPHID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0xFEC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CUSTOMER_MOD_NUMBER</name>
              <description>Customer Modification Number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ECO_REV_NUMBER</name>
              <description>ECO Revision Number</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TIMERPCELLID0</name>
          <description>Component ID Register 0</description>
          <addressOffset>0xFF0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPCELLID1</name>
          <description>Component ID Register 1</description>
          <addressOffset>0xFF4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPCELLID2</name>
          <description>Component ID Register 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>TIMERPCELLID3</name>
          <description>Component ID Register 3</description>
          <addressOffset>0xFFC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xff</resetMask>
        </register>
