JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = I2C :: Name = I2C0 -->
      <name>I2C0</name>
      <version>1.0.0</version>
      <description>I2C Master/Slave Controller</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40003000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>TRANSMIT_DATA</name>
          <description>Writes one byte to I2C Transmit Data FIFO. </description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>

          <fields>
            <field>
              <name>TX_DATA</name>
              <description>Represents either Tx Data, or Address and Direction if address flag is set. </description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>

            <field>
              <name>ADDRESS_FLAG</name>
              <description>Specifies that tx_data field is used for address and direction.</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>tx_data field bits 7:0 are Transmit Data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>tx_data field bit 0 is direction (0: write to slave, 1: read from slave), and bits 7:1 are the Address to transmit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_DATA</name>
          <description>Read one byte from I2C Receive Data FIFO. </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>RX_BYTE</name>
              <description>Oldest data in receive FIFO. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TRANSMIT_STATUS</name>
          <description>Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL</name>
              <description>Active High indication when Tx FIFO can still accepts at least one more character.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>TX FIFO Full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>TX FIFO not Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least quarter empty. Reset when more. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least half empty. Reset when more. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least three quarters empty. Reset when more. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY</name>
              <description>Active High indication when Tx FIFO is Empty and has no more character to transmit </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_STATUS</name>
          <description>Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. </description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY</name>
              <description>Active High indication when data is available in Rx FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL</name>
              <description>Active High indication when FIFO is at least quarter full. Reset when less. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL</name>
              <description>Active High indication when FIFO is at least half full. Reset when less. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL</name>
              <description>Active High indication when FIFO is at least three quarters full. Reset when less. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FIFO_OVERRUN</name>
              <description>Active High indication when character is received but FIFO is full. Reset by reading  the status register. </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>NAK</name>
              <description>Active High indication when NAK is received. The I2C module will retry transmission  unless transaction aborted by the flush register. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CLOCK_SOURCE_SELECT</name>
          <description>Clock Source Select</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>CLOCK</name>
              <description>Clock Used to Generate Divided Clock</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26 MHz Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13 MHz Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5 MHz Clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25 MHz Clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_MODULE_ENABLE</name>
          <description>I2C Enable</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables I2C Operation</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_CLK_DIVIDER</name>
          <description>Register sets the divide ratio used to generate the sck clock from the module's input clock. </description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>I2C_DIVIDE_RATIO</name>
              <description>Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal. </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_MASTER_MODE</name>
          <description>Selects I2C Master or Slave Mode. </description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>MASTER_ENABLE</name>
              <description>Active High I2C Master Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>I2C Slave</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>I2C Master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_ONBUS</name>
          <description>Enable/Disable transactions when in Master Mode. </description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>ONBUS_ENABLE</name>
              <description>Active High Enable to initiate transactions when in Master Mode.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Master completes current byte and generates stop condition on bus.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Master tranmits contents of FIFO until empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_SLAVE_ADDRESS</name>
          <description>Configures the I2C slave Address. </description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>

          <fields>
            <field>
              <name>ADDRESS</name>
              <description>I2C Slave Address </description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_STATUS</name>
          <description>Status of I2C Module. </description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>I2C_ACTIVE</name>
              <description>Active High indicatation that the I2C Module is active. While set, I2C configuration  should not be modified. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the tx_status register. </description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL_MASK</name>
              <description>Active High Enable of tx_fifo_not_full interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p25_empty interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p5_empty interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p75_empty interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_empty interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the rx_status register. </description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY_MASK</name>
              <description>Active High Enable of rx_fifo_not_empty interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p25_full interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p5_full interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p75_full interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERRUN_MASK</name>
              <description>Active High Enable of FIFO overrun interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>NAK_MASK</name>
              <description>Active High Enable NAK interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>I2C_FLUSH</name>
          <description>Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted. </description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
        </register>
