JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="I2C0"> <!-- Family =  I2C :: Name = I2C1 -->
      <name>I2C1</name>
      <baseAddress>0x40003400</baseAddress>
    </peripheral>

    <peripheral> <!-- Family = UART :: Name = UART0 -->
      <name>UART0</name>
      <version>1.0.0</version>
      <description>UART Controller</description>
      <groupName>UART</groupName>
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>TRANSMIT_DATA</name>
          <description>Writes one byte to UART Transmit Data FIFO. </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>TX_BYTE</name>
              <description>Writes data in transmit FIFO. If byte length is set to 7, the MSB should be set to 0. </description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TRANSMIT_STATUS</name>
          <description>Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL</name>
              <description>Active High indication when Tx FIFO can still accepts at least one more character. 0: TX FIFO Full. 1: TX FIFO not Full. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least quarter empty. Reset when more. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least half empty. Reset when more. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY</name>
              <description>Active High indication when Tx FIFO is at least three quarters empty. Reset when more. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY</name>
              <description>Active High indication when Tx FIFO is Empty and has no more character to transmit </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>CTS_ACTIVE</name>
              <description>Active High indication when flow control signal "cts" is active. Unaffected by cts  enable bit in config register. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>TX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the tx_status register. </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>TX_FIFO_NOT_FULL_MASK</name>
              <description>Active High Enable of tx_fifo_not_full interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P25_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p25_empty interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P5_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p5_empty interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_0P75_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_0p75_empty interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TX_FIFO_EMPTY_MASK</name>
              <description>Active High Enable of tx_fifo_empty interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CTS_ACTIVE_MASK</name>
              <description>Active High Enable of cts_active interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_DATA</name>
          <description>Read one byte from UART Receive Data FIFO. </description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>RX_BYTE</name>
              <description>Oldest data in receive FIFO. If byte length is set to 7, the MSB is set to 0. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_STATUS</name>
          <description>Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. </description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY</name>
              <description>Active High indication when data is available in Rx FIFO. 0: RX FIFO Empty. 1: RX FIFO contains at least one byte of data. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL</name>
              <description>Active High indication when FIFO is at least quarter full. Reset when less. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL</name>
              <description>Active High indication when FIFO is at least half full. Reset when less. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL</name>
              <description>Active High indication when FIFO is at least three quarters full. Reset when less. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>TIMEOUT</name>
              <description>Active High indication when the timeout set in the rx_timeout register has elapsed since  the last interaction with the receiver. Reset by reading the status register.  </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>PARITY_ERROR</name>
              <description>Active High indication when a receive parity error is detected. Reset by reading the status register. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FIFO_OVERRUN</name>
              <description>Active High indication when character is received but FIFO is full. Reset by reading the status register. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>FRAMING_ERROR</name>
              <description>Active High indication when no stop bit is detected. Reset by reading the status register. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RX_INTERRUPT_MASK</name>
          <description>Enable or Disable the generation of interrupts by the rx_status register. </description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>RX_FIFO_NOT_EMPTY_MASK</name>
              <description>Active High Enable of rx_fifo_not_empty interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P25_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p25_full interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P5_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p5_full interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RX_FIFO_0P75_FULL_MASK</name>
              <description>Active High Enable of rx_fifo_0p75_full interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>TIMEOUT_MASK</name>
              <description>Active High Enable of timeout interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PARITY_ERROR_MASK</name>
              <description>Active High Enable of parity error interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FIFO_OVERRUN_MASK</name>
              <description>Active High Enable of FIFO overrun interrupt </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>FRAMING_ERROR_MASK</name>
              <description>Active High Enable of framing error interrupt </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RECEIVE_TIMEOUT</name>
          <description>Timeout counter configuration. </description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>TIMEOUT_VALUE</name>
              <description>Timeout counter reload value, after status register is read or character received.  Counter decrements at baud rate clock. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UART_CONFIGURATION</name>
          <description>UART Operation Configuration Register, for both Rx and Tx. </description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>NUMBER_OF_BITS</name>
              <description>Number of bits per character, not including parity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>8 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>7 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PARITY_ENABLE</name>
              <description>Active High parity checking and generation enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PARITY_MODE</name>
              <description>Parity Mode Select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Even Parity</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Odd Parity</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Parity bit is space</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Parity bit is mark</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>STOP_BITS</name>
              <description>Number of stop bits</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>One Bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Two Bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>CTS_ENABLE</name>
              <description>Active High Flow Control Enable. When enabled, transmission starts when cts signal is asserted</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable-Transmission starts only when cts signal is asserted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable-Transmission starts regardless of cts signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>UART_BAUD_RATE</name>
          <description>Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division. </description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>FRACTIONAL_DIVISION</name>
              <description>Fractional Division Part. If non-zero, the integer part must be at least set to 3. </description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INTEGER_DIVISION</name>
              <description>Integral Division Part. Must be at least set to 2. </description>
              <bitRange>[15:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UART_CLOCK_SOURCE</name>
          <description>Selects Source of UART Clock </description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>CLOCK_SELECT</name>
              <description>Selects one of the four possible clock sources.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock input 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock input 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Clock input 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Clock input 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
