JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = LPMCU_MISC_REGS :: Name = LPMCU_MISC_REGS0 -->
      <name>LPMCU_MISC_REGS0</name>
      <version>1.0.0</version>
      <description>LPMCU Misc Registers</description>
      <groupName>LPMCU_MISC_REGS</groupName>
      <baseAddress>0x4000b000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>LPMCU_CHIP_ID</name>
          <description>The hard-coded ID for the chip.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000B0</resetValue>
          <resetMask>0xffffff</resetMask>

          <fields>
            <field>
              <name>REV_ID</name>
              <description>Chip ID</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_GLOBAL_RESET_0</name>
          <description>All individual software controllable resets. 0: Reset the selected function. 1: Normal operation. </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFD</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>GLOBAL_RSTN</name>
              <description>LPMCU Global Reset (self setting)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CPU_RSTN</name>
              <description>LPMCU CPU Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPIFLASH_SYS_RSTN</name>
              <description>SPI_FLASH0 Sys Reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPIFLASH_RSTN</name>
              <description>SPI_FLASH0 Interface Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI0_CORE_RSTN</name>
              <description>SPI0 Core Reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI0_IF_RSTN</name>
              <description>SPI0 Interface Reset</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI1_CORE_RSTN</name>
              <description>SPI1 Core Reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI1_IF_RSTN</name>
              <description>SPI1 Interface Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C0_CORE_RSTN</name>
              <description>I2C0 Core Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C0_IF_RSTN</name>
              <description>I2C0 Interface Reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>GPIO_RSTN</name>
              <description>GPIO Controller Reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COUNTER_0_RSTN</name>
              <description>TIMER0 Reset</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_CORE_RSTN</name>
              <description>UART0 Core Reset</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_IF_RSTN</name>
              <description>UART0 Interface Reset</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_1_CORE_RSTN</name>
              <description>UART1 Core Reset</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_1_IF_RSTN</name>
              <description>UART1 Interface Reset</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WATCHDOG_0_RSTN</name>
              <description>WDT0 Reset</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WATCHDOG_1_RSTN</name>
              <description>WDT1 Reset</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IRQ_CTRLR_CORE_RSTN</name>
              <description>NVIC Reset</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>MBIST_RSTN</name>
              <description>MBIST Logic Reset</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CALIB_RSTN</name>
              <description>Low Power Clock Calibration Core Reset</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CALIB_XBAR_IF_RSTN</name>
              <description>Low Power Clock Calibration APB Reset</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DBUG_RSTN</name>
              <description>LPMCU Debug Reset</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ARM_FREE_CLK_RSTN</name>
              <description>Free Running ARM Clock Reset</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ARM_PRESETN_RSTN</name>
              <description>ARM APB Reset</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_1_RSTN</name>
              <description>QUAD_DEC0 Reset</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_2_RSTN</name>
              <description>QUAD_DEC1 Reset</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_3_RSTN</name>
              <description>QUAD_DEC2 Reset</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_1_RSTN</name>
              <description>PWM0 Reset</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_2_RSTN</name>
              <description>PWM1 Reset</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_3_RSTN</name>
              <description>PWM2 Reset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_4_RSTN</name>
              <description>PWM3 Reset</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_GLOBAL_RESET_1</name>
          <description>All individual software controllable resets. 0: Reset the selected function. 1: Normal operation. </description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xfff</resetMask>

          <fields>
            <field>
              <name>DUALTIMER_RSTN</name>
              <description>DUALTIMER0 Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C1_CORE_RSTN</name>
              <description>I2C1 Core Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C1_IF_RSTN</name>
              <description>I2C1 Interface Reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SECURITY_SHA_CORE_RSTN</name>
              <description>Security SHA Core Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SECURITY_SHA_AHB_RSTN</name>
              <description>Security SHA AHB Interface Reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SECURITY_AES_CORE_RSTN</name>
              <description>Security AES Core Reset</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SECURITY_AES_AHB_RSTN</name>
              <description>Security AES AHB Interface Reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI0_SCK_CLK_RSTN</name>
              <description>SPI0 SCK Clock Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI1_SCK_CLK_RSTN</name>
              <description>SPI1 SCK Clock Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI0_SCK_PHASE_INT_CLK_RSTN</name>
              <description>SPI0 SCK Phase Clock Reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI1_SCK_PHASE_INT_CLK_RSTN</name>
              <description>SPI1 SCK Phase Clock Reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DMA_CONTROLLER_RSTN</name>
              <description>PROV_DMA_CTRL0 Reset</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_CLOCK_ENABLES_0</name>
          <description>All individual software controllable clock enables. Values are:  0: Disable clock.  1: Normal operation. </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x627FF9BE</resetValue>
          <resetMask>0x7ffff9be</resetMask>

          <fields>
            <field>
              <name>SPIFLASH_CLK_EN</name>
              <description>SPI_FLASH0 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI0_CORE_CLK_EN</name>
              <description>SPI0 Core Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_SPI1_CORE_CLK_EN</name>
              <description>SPI1 Core Clock Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C0_CORE_CLK_EN</name>
              <description>I2C0 Core Clock Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>DUALTIMER_CLK_EN</name>
              <description>DUALTIMER0 Clock Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>GPIO_CLK_EN</name>
              <description>GPIO Controller Clock Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COUNTER_0_CLK_EN</name>
              <description>TIMER0 Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WATCHDOG_0_CLK_EN</name>
              <description>WDT0 Clock Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WATCHDOG_1_CLK_EN</name>
              <description>WDT1 Clock Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_CORE_CLK_EN</name>
              <description>UART0 Core Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_IF_CLK_EN</name>
              <description>UART0 Interface Clock Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_1_CORE_CLK_EN</name>
              <description>UART1 Core Clock Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>UART_1_IF_CLK_EN</name>
              <description>UART1 Interface Clock Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IRQ_CTRLR_CORE_CLK_EN</name>
              <description>NVIC Clock Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_1_GL_MEM_CLK_EN</name>
              <description>IDRAM1 Glue Logic Clock Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>IDRAM_2_GL_MEM_CLK_EN</name>
              <description>IDRAM2 Glue Logic Clock Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ROM_MEM_CLK_EN</name>
              <description>ROM Clock Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CALIB_XBAR_IF_CLK_EN</name>
              <description>Low Power Clock Calibration Interface Clock Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AON_WRAPPER_CLK_EN</name>
              <description>AON Wrapper Clock Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ARM_PCLK_EN</name>
              <description>ARM PCLK Clock Enable (override)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ARM_PCLKG_EN</name>
              <description>ARM Gated PCLK Clock Enable (override)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_MEM_CLK_EN</name>
              <description>ARM BLE 8K Retention Memory Clock Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_1_CLK_EN</name>
              <description>QUAD_DEC0 Clock Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_2_CLK_EN</name>
              <description>QUAD_DEC1 Clock Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>QUAD_DEC_3_CLK_EN</name>
              <description>QUAD_DEC2 Clock Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CORTUS_I2C1_CORE_CLK_EN</name>
              <description>I2C1 Core Clock Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CALIB_CLK_EN</name>
              <description>Low Power Clock Calibration Core Clock Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>LPMCU_CLOCK_ENABLES_1</name>
          <description>All individual software controllable clock enables. Values are:  0: Disable clock.  1: Normal operation. </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF8783F</resetValue>
          <resetMask>0xffffff</resetMask>

          <fields>
            <field>
              <name>EFUSE_1_CLK_EN</name>
              <description>EFUSE0 Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_2_CLK_EN</name>
              <description>EFUSE1 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_3_CLK_EN</name>
              <description>EFUSE2 Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_4_CLK_EN</name>
              <description>EFUSE3 Clock Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_5_CLK_EN</name>
              <description>EFUSE4 Clock Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>EFUSE_6_CLK_EN</name>
              <description>EFUSE5 Clock Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_1_CLK_EN</name>
              <description>PWM0 Clock Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_2_CLK_EN</name>
              <description>PWM1 Clock Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_3_CLK_EN</name>
              <description>PWM2 Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PWM_4_CLK_EN</name>
              <description>PWM3 Clock Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SENS_ADC_CLK_EN</name>
              <description>PMU Sensor ADC Clock Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPI0_SCK_PHASE_INT_CLK_EN</name>
              <description>SPI0 SCK Phase Internal Clock Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SPI1_SCK_PHASE_INT_CLK_EN</name>
              <description>SPI1 SCK Phase Internal Clock Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>GPIO_GCLK_EN</name>
              <description>GPIO Controller Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>COUNTER_0_PGCLK_EN</name>
              <description>TIMER0 Gated APB Clock</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SHA_CORE_CLK_EN</name>
              <description>SHA Core Clock Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SHA_AHB_CLK_EN</name>
              <description>SHA AHB Clock Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AES_CORE_CLK_EN</name>
              <description>AES Core Clock Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

