JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>LP_GPIO_15_SEL</name>
              <description>Pinmux select for LP_GPIO_15</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_15</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PINMUX_SEL_2</name>
          <description>Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x77777777</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_16_SEL</name>
              <description>Pinmux select for LP_GPIO_16</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SCK</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SSN</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_16</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_17_SEL</name>
              <description>Pinmux select for LP_GPIO_17</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_TXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SCK</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MOSI</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_17</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_18_SEL</name>
              <description>Pinmux select for LP_GPIO_18</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_SSN</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_MISO</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SSN</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_18</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_19_SEL</name>
              <description>Pinmux select for LP_GPIO_19</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_FLASH0_RXD</name>
                  <description>MUX function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_MOSI</name>
                  <description>MUX function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_MISO</name>
                  <description>MUX function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_19</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_20_SEL</name>
              <description>Pinmux select for LP_GPIO_20</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_OUT_20</name>
                  <description>MUX function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_21_SEL</name>
              <description>Pinmux select for LP_GPIO_21</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_22_SEL</name>
              <description>Pinmux select for LP_GPIO_22</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_23_SEL</name>
              <description>Pinmux select for LP_GPIO_23</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>MUX function 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEGAMUX</name>
                  <description>MUX function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PULL_ENABLE</name>
          <description>Active Low Pull Enables for LPMCU Pads</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf9ffffff</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_0</name>
              <description>Pull Enable for LP_GPIO_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_1</name>
              <description>Pull Enable for LP_GPIO_1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_2</name>
              <description>Pull Enable for LP_GPIO_2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_3</name>
              <description>Pull Enable for LP_GPIO_3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_4</name>
              <description>Pull Enable for LP_GPIO_4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_5</name>
              <description>Pull Enable for LP_GPIO_5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_6</name>
              <description>Pull Enable for LP_GPIO_6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_7</name>
              <description>Pull Enable for LP_GPIO_7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_8</name>
              <description>Pull Enable for LP_GPIO_8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_9</name>
              <description>Pull Enable for LP_GPIO_9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_10</name>
              <description>Pull Enable for LP_GPIO_10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_11</name>
              <description>Pull Enable for LP_GPIO_11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_12</name>
              <description>Pull Enable for LP_GPIO_12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_13</name>
              <description>Pull Enable for LP_GPIO_13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_14</name>
              <description>Pull Enable for LP_GPIO_14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_15</name>
              <description>Pull Enable for LP_GPIO_15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_16</name>
              <description>Pull Enable for LP_GPIO_16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_17</name>
              <description>Pull Enable for LP_GPIO_17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_18</name>
              <description>Pull Enable for LP_GPIO_18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_19</name>
              <description>Pull Enable for LP_GPIO_19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_20</name>
              <description>Pull Enable for LP_GPIO_20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_21</name>
              <description>Pull Enable for LP_GPIO_21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_22</name>
              <description>Pull Enable for LP_GPIO_22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_23</name>
              <description>Pull Enable for LP_GPIO_23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_0</name>
              <description>Pull Enable for LP_SIP_0</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_1</name>
              <description>Pull Enable for LP_SIP_1</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_2</name>
              <description>Pull Enable for LP_SIP_2</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_3</name>
              <description>Pull Enable for LP_SIP_3</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_SIP_4</name>
              <description>Pull Enable for LP_SIP_4</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>RTYPE_PAD_0</name>
          <description>Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up)</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffffff</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_0</name>
              <description>Controls RTYPE (Pull Level) value for LP_GPIO_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_1</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_2</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_3</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_4</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_5</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_6</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_7</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_8</name>
              <description>Controls RTYPE (Pull Level) value for LP_GPIO_8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_9</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_10</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_11</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_12</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_13</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_14</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_15</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_16</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_17</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_18</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>LP_GPIO_19</name>
              <description>Controls RTYPE (Pull Level) value LP_GPIO_19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>

