JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>MUX_6</name>
              <description>IRQ_6 Source Selection</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SPI1 RX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MUX_7</name>
              <description>IRQ_7 Source Selection</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SPI1 TX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>IRQ_MUX_IO_SEL_2</name>
          <description>Arm Cortex IRQ Mux Selection (Refer to Interrupts Spreadsheet)</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f1f1f</resetMask>

          <fields>
            <field>
              <name>MUX_8</name>
              <description>IRQ_8 Source Selection</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>I2C0 RX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MUX_9</name>
              <description>IRQ_9 Source Selection</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>I2C0 TX</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

