JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>MUX_18</name>
              <description>IRQ_18 Source Selection</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MUX_19</name>
              <description>IRQ_19 Source Selection</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>IRQ_MUX_IO_SEL_5</name>
          <description>Arm Cortex IRQ Mux Selection (Refer to Interrupts Spreadsheet)</description>
          <addressOffset>0xD4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>MUX_20</name>
              <description>IRQ_20 Source Selection</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>UART0 RX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0 TX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART1 RX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1 TX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>SPI0 RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SPI0 TX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>SPI1 RX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>SPI1 TX</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>I2C0 RX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>I2C0 TX</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>I2C1 RX</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>I2C1 TX</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>WDT0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>WDT1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>DUALTIMER0</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>PROV_DMA_CTRL0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SECURITY</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>EFUSE_OUT_OF_RESET</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>QUAD_DEC0_1_2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>BLE_FRONTEND</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>PROG_AHB_TRIG_TIMEOUT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>SXPLL_NEED_RESET</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>LP_CLK_CAL_DONE</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>BROWNOUT_DETECTED</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PWM_1_CONTROL</name>
          <description>PWM 1 Control Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7fffff</resetMask>

          <fields>
            <field>
              <name>PWM_EN</name>
              <description>Active High PWM Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>OUTPUT_POLARITY</name>
              <description>1 to inverse the polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_FMT</name>
              <description>AGC data format</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SAMPLE_METHOD</name>
              <description>Sample Method</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Samples agcdata at >= 1024 cycles and does not lose precision</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Samples at PWM period but will lose LSBs if less than 1024</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PWM_PERIOD</name>
              <description>programmable PWM update period</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_IN</name>
              <description>agc value from AGC</description>
              <bitRange>[18:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>PWM Source Clock Frequency Select</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PWM_2_CONTROL</name>
          <description>PWM 2 Control Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7fffff</resetMask>

          <fields>
            <field>
              <name>PWM_EN</name>
              <description>Active High PWM Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>OUTPUT_POLARITY</name>
              <description>1 to inverse the polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_FMT</name>
              <description>AGC data format</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SAMPLE_METHOD</name>
              <description>Sample Method</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Samples agcdata at >= 1024 cycles and does not lose precision</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Samples at PWM period but will lose LSBs if less than 1024</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PWM_PERIOD</name>
              <description>programmable PWM update period</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_IN</name>
              <description>agc value from AGC</description>
              <bitRange>[18:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>PWM Source Clock Frequency Select</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PWM_3_CONTROL</name>
          <description>PWM 3 Control Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7fffff</resetMask>

          <fields>
            <field>
              <name>PWM_EN</name>
              <description>Active High PWM Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>OUTPUT_POLARITY</name>
              <description>1 to inverse the polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_FMT</name>
              <description>AGC data format</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

