JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>SAMPLE_METHOD</name>
              <description>Sample Method</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Samples agcdata at >= 1024 cycles and does not lose precision</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Samples at PWM period but will lose LSBs if less than 1024</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PWM_PERIOD</name>
              <description>programmable PWM update period</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_IN</name>
              <description>agc value from AGC</description>
              <bitRange>[18:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>PWM Source Clock Frequency Select</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PWM_4_CONTROL</name>
          <description>PWM 4 Control Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7fffff</resetMask>

          <fields>
            <field>
              <name>PWM_EN</name>
              <description>Active High PWM Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>OUTPUT_POLARITY</name>
              <description>1 to inverse the polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_FMT</name>
              <description>AGC data format</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>SAMPLE_METHOD</name>
              <description>Sample Method</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Samples agcdata at >= 1024 cycles and does not lose precision</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Samples at PWM period but will lose LSBs if less than 1024</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>PWM_PERIOD</name>
              <description>programmable PWM update period</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>AGCDATA_IN</name>
              <description>agc value from AGC</description>
              <bitRange>[18:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>PWM Source Clock Frequency Select</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>MBIST_DUAL_STATUS</name>
          <description>Reflects the status of MBIST from lpmcu and btmcu</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fffff</resetMask>

          <fields>
            <field>
              <name>MBIST_BUS</name>
              <description>Observation of lpmcu and btmcu MBIST results</description>
              <bitRange>[20:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DUALTIMER_CTRL</name>
          <description>Dual Timer Control</description>
          <addressOffset>0x188</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>

          <fields>
            <field>
              <name>CNTR_1_ENABLE</name>
              <description>Enable Dual Timer 1 Decoder</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CNTR_2_ENABLE</name>
              <description>Enable Dual Timer 2 Decoder</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ARM_SLEEP_WAKEUP_CTRL</name>
          <description>Sleep and Wakeup Control for the AON Power Sequencer</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0x1010001</resetMask>

          <fields>
            <field>
              <name>SLEEP_1</name>
              <description>Sleep Request 1 from the ARM to the AON Power Sequencer</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>WAKEUP</name>
              <description>Wakeup Request from the ARM to the AON Power Sequencer</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RXTX_WAKEUP</name>
              <description>Wakeup Request from the ARM to the RxTx Sequencer</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MEGA_MUX_IO_SEL_0</name>
          <description>Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F3F3F3F</resetValue>
          <resetMask>0x3f3f3f3f</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_0</name>
              <description>LP_GPIO_0 mega mux selection</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_1</name>
              <description>LP_GPIO_1 mega mux selection</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

