JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>LP_GPIO_11</name>
              <description>LP_GPIO_11 mega mux selection</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>MEGA_MUX_IO_SEL_3</name>
          <description>Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F3F3F3F</resetValue>
          <resetMask>0x3f3f3f3f</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_12</name>
              <description>LP_GPIO_12 mega mux selection</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>LP_GPIO_13</name>
              <description>LP_GPIO_13 mega mux selection</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

