JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>LP_GPIO_23</name>
              <description>LP_GPIO_23 mega mux selection</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>MEGA_MUX_IO_SEL_6</name>
          <description>Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)</description>
          <addressOffset>0x1B8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3f</resetMask>

          <fields>
            <field>
              <name>LP_GPIO_24</name>
              <description>LP_GPIO_24 mega mux selection</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RXD</name>
                  <description>UART0_RXD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TXD</name>
                  <description>UART0_TXD</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0_CTS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0_RTS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RXD</name>
                  <description>UART1_RXD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TXD</name>
                  <description>UART1_TXD</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1_CTS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1_RTS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>I2C0_SDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>I2C0_SCL</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>I2C1_SDA</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>I2C1_SCL</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_OUT</name>
                  <description>PWM0_OUT</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_OUT</name>
                  <description>PWM1_OUT</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_OUT</name>
                  <description>PWM2_OUT</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_OUT</name>
                  <description>PWM3_OUT</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHZ_CLK</name>
                  <description>32KHZ_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_TX</name>
                  <description>COEX_WLAN_TX</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_WLAN_RX</name>
                  <description>COEX_WLAN_RX</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_TX</name>
                  <description>COEX_BLE_TX</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RX</name>
                  <description>COEX_BLE_RX</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_IN_PROCESS</name>
                  <description>COEX_BLE_IN_PROCESS</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_MBSY</name>
                  <description>COEX_BLE_MBSY</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_SYNC</name>
                  <description>COEX_BLE_SYNC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_RXNTX</name>
                  <description>COEX_BLE_RXNTX</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_0</name>
                  <description>COEX_BLE_PTI_0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_1</name>
                  <description>COEX_BLE_PTI_1</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_2</name>
                  <description>COEX_BLE_PTI_2</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_BLE_PTI_3</name>
                  <description>COEX_BLE_PTI_3</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_A</name>
                  <description>QUAD_DEC0_A</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC0_B</name>
                  <description>QUAD_DEC0_B</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_A</name>
                  <description>QUAD_DEC1_A</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC1_B</name>
                  <description>QUAD_DEC1_B</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_A</name>
                  <description>QUAD_DEC2_A</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_DEC2_B</name>
                  <description>QUAD_DEC2_B</description>
                  <value>0x22</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SENS_ADC_CLK_CTRL</name>
          <description>Clock control for the Sensor ADC</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A00</resetValue>
          <resetMask>0x1fffff</resetMask>

          <fields>
            <field>
              <name>FRAC_PART</name>
              <description>Fractional part for the clock divider</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INT_PART</name>
              <description>Integer part for the clock divider</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>INVERT</name>
              <description>Invert Sens ADC Clock</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SENS_ADC_RAW_STATUS</name>
          <description>Raw Status from the Sensor ADC</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x137ff</resetMask>

          <fields>
            <field>
              <name>ADC_OUT</name>
              <description>Raw Status of the sens_adc_out port of the PMU</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ADC_CH</name>
              <description>Raw Status of the sens_adc_ch port of the PMU</description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ADC_DONE</name>
              <description>Raw Status of the sens_adc_done port of the PMU</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SENS_ADC_CH0_DATA</name>
          <description>Current data of the Sensor ADC for Channel 0</description>
          <addressOffset>0x1C8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
        </register>

        <register>
          <name>SENS_ADC_CH1_DATA</name>
          <description>Current data of the Sensor ADC for Channel 1</description>
          <addressOffset>0x1CC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
        </register>

        <register>
          <name>SENS_ADC_CH2_DATA</name>
          <description>Current data of the Sensor ADC for Channel 2</description>
          <addressOffset>0x1D0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
        </register>

        <register>
          <name>SENS_ADC_CH3_DATA</name>
          <description>Current data of the Sensor ADC for Channel 3</description>
          <addressOffset>0x1D4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
        </register>

        <register>
          <name>IRQ_CTRL</name>
          <description>Configure the IRQ inputs to the system as either Rising Edge or Level Shift</description>
          <addressOffset>0x1E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>

          <fields>
            <field>
              <name>BLE_LVL_OSC_EN_IRQ_EN</name>
              <description>Enable the OSC_en signal for Level Shift and Clear Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_OSC_EN_IRQ_CLR</name>
              <description>if ble_lvl_osc_en_irq_en is enabled, setting irq clr to 1 will clear the irq request</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_WAKEUP_LP_IRQ_EN</name>
              <description>Enable the wakeup_lp signal for Level Shift and Clear Mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_WAKEUP_LP_IRQ_CLR</name>
              <description>if ble_lvl_wakeup_lp_irq_en is enabled, setting irq clr to 1 will clear the irq request</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN</name>
              <description>Enable the lp_out_of_reset signal for Level Shift and Clear Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR</name>
              <description>if lp_out_of_reset is enabled, setting irq clr to 1 will clear the irq request</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN</name>
              <description>Enable the core_out_of_reset signal for Level Shift and Clear Mode</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR</name>
              <description>if core_out_of_reset is enabled, setting irq clr to 1 will clear the irq request</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN</name>
              <description>Enable the rxtx_seq_in_sleep signal for Level Shift and Clear Mode</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR</name>
              <description>if rxtx_seq_in_sleep is enabled, setting irq clr to 1 will clear the irq request</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>IRQ_STS</name>
          <description>Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores</description>
          <addressOffset>0x1EC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>BLE_OSC_EN_IRQ</name>
              <description>Read the OSC_en signal from the lp core</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_WAKEUP_LP_IRQ</name>
              <description>Read the wakeup_lp_irq signal from the lp core</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_LP_OUT_OF_RESET_IRQ</name>
              <description>Read the ble_lp_out_of_reset signal from the ble lp core</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLE_CORE_OUT_OF_RESET_IRQ_EN</name>
              <description>Read the ble_core_out_of_reset_irq signal from the ble core</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

