JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
        <register>
          <name>QUAD_DEC_3_CTRL</name>
          <description>Control for Quad Decoder 3</description>
          <addressOffset>0x2B4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Quad Decoder</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLR_IRQ</name>
              <description>Clear IRQ From Quad Decoder</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLOCK_SEL</name>
              <description>Quad Decoder Source Clock Frequency Select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>26MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>6.5MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3.25MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>FP_COMP0_COMP</name>
          <description>Flash Breakpoint Compare Register 0</description>
          <addressOffset>0x2C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP1_COMP</name>
          <description>Flash Breakpoint Compare Register 1</description>
          <addressOffset>0x2C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP2_COMP</name>
          <description>Flash Breakpoint Compare Register 2</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP3_COMP</name>
          <description>Flash Breakpoint Compare Register 3</description>
          <addressOffset>0x2CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP4_COMP</name>
          <description>Flash Breakpoint Compare Register 4</description>
          <addressOffset>0x2D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP5_COMP</name>
          <description>Flash Breakpoint Compare Register 5</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP6_COMP</name>
          <description>Flash Breakpoint Compare Register 6</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP7_COMP</name>
          <description>Flash Breakpoint Compare Register 7</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP8_COMP</name>
          <description>Flash Breakpoint Compare Register 8</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP9_COMP</name>
          <description>Flash Breakpoint Compare Register 9</description>
          <addressOffset>0x2E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP10_COMP</name>
          <description>Flash Breakpoint Compare Register 10</description>
          <addressOffset>0x2E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP11_COMP</name>
          <description>Flash Breakpoint Compare Register 11</description>
          <addressOffset>0x2EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP12_COMP</name>
          <description>Flash Breakpoint Compare Register 12</description>
          <addressOffset>0x2F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP13_COMP</name>
          <description>Flash Breakpoint Compare Register 13</description>
          <addressOffset>0x2F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP14_COMP</name>
          <description>Flash Breakpoint Compare Register 14</description>
          <addressOffset>0x2F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP15_COMP</name>
          <description>Flash Breakpoint Compare Register 15</description>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP0_REPLACE</name>
          <description>Flash Breakpoint Replace Register 0</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP1_REPLACE</name>
          <description>Flash Breakpoint Replace Register 1</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP2_REPLACE</name>
          <description>Flash Breakpoint Replace Register 2</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP3_REPLACE</name>
          <description>Flash Breakpoint Replace Register 3</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP4_REPLACE</name>
          <description>Flash Breakpoint Replace Register 4</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP5_REPLACE</name>
          <description>Flash Breakpoint Replace Register 5</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP6_REPLACE</name>
          <description>Flash Breakpoint Replace Register 6</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP7_REPLACE</name>
          <description>Flash Breakpoint Replace Register 7</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP8_REPLACE</name>
          <description>Flash Breakpoint Replace Register 8</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP9_REPLACE</name>
          <description>Flash Breakpoint Replace Register 9</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP10_REPLACE</name>
          <description>Flash Breakpoint Replace Register 10</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP11_REPLACE</name>
          <description>Flash Breakpoint Replace Register 11</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP12_REPLACE</name>
          <description>Flash Breakpoint Replace Register 12</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP13_REPLACE</name>
          <description>Flash Breakpoint Replace Register 13</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP14_REPLACE</name>
          <description>Flash Breakpoint Replace Register 14</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP15_REPLACE</name>
          <description>Flash Breakpoint Replace Register 14</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ffff</resetMask>
        </register>

        <register>
          <name>FP_COMP_ENABLE</name>
          <description>Flash Breakpoint Enable Register</description>
          <addressOffset>0x340</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffff</resetMask>

          <fields>
            <field>
              <name>CMP_0_EN</name>
              <description>Enable Compare 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_1_EN</name>
              <description>Enable Compare 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_2_EN</name>
              <description>Enable Compare 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_3_EN</name>
              <description>Enable Compare 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_4_EN</name>
              <description>Enable Compare 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_5_EN</name>
              <description>Enable Compare 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_6_EN</name>
              <description>Enable Compare 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_7_EN</name>
              <description>Enable Compare 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_8_EN</name>
              <description>Enable Compare 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_9_EN</name>
              <description>Enable Compare 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_10_EN</name>
              <description>Enable Compare 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_11_EN</name>
              <description>Enable Compare 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_12_EN</name>
              <description>Enable Compare 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_13_EN</name>
              <description>Enable Compare 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_14_EN</name>
              <description>Enable Compare 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CMP_15_EN</name>
              <description>Enable Compare 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>PMU_READ_REGS</name>
          <description>PMU Status Registers</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffff</resetMask>

          <fields>
            <field>
              <name>READREG1</name>
              <description>PMU Read Register 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>READREG2</name>
              <description>PMU Read Register 2</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>READREG3</name>
              <description>PMU Read Register 3</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MS_GPIO</name>
          <description>Control for Mixed Signal GPIOs</description>
          <addressOffset>0x414</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PULL_TYPE_44</name>
              <description>Mixed Signal LP_GPIO_44 Pull Type Select. 1: PD, 0: PU.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_TYPE_45</name>
              <description>Mixed Signal LP_GPIO_45 Pull Type Select. 1: PD, 0: PU.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_TYPE_46</name>
              <description>Mixed Signal LP_GPIO_46 Pull Type Select. 1: PD, 0: PU.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_TYPE_47</name>
              <description>Mixed Signal LP_GPIO_47 Pull Type Select. 1: PD, 0: PU.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_ENABLE_44</name>
              <description>Active Low Pull Enable for Mixed Signal LP_GPIO_44</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_ENABLE_45</name>
              <description>Active Low Pull Enable for Mixed Signal LP_GPIO_45</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_ENABLE_46</name>
              <description>Active Low Pull Enable for Mixed Signal LP_GPIO_46</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>PULL_ENABLE_47</name>
              <description>Active Low Pull Enable for Mixed Signal LP_GPIO_47</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>AON_SLEEP_TIMER_COUNTER</name>
          <description>Current value of the AON Sleep Timer (syncd to ARM clock)</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>
        </register>
