JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
            <field>
              <name>OFFSET_CAL_EN</name>
              <description>Enable sensor ADC offset calibration</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RESERVED_7</name>
              <description>not using</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>CLK_CTRL_26MHZ</name>
              <description>Control the 26MHz RC oscillator frequency</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>12MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>13MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>14MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>15MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>16MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>17MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>18MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>19MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>20MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>21MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>22MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>23MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>24MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>25MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>26MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>27MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>28MHz</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>29MHz</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>30MHz</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>31MHz</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>32MHz</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>33MHz</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>34MHz</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>35MHz</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>36MHz</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>37MHz</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>38MHz</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>39MHz</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>40MHz</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>41MHz</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>42MHz</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>43MHz</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>RESERVED_15_13</name>
              <description>not using</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>MS_GPIO_MODE</name>
          <description>Analog Mode Select of Mixed Signal GPIOs</description>
          <addressOffset>0x410</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xf</resetMask>

          <fields>
            <field>
              <name>ANALOG_ENABLE_44</name>
              <description>Active High Analog Mode Enable for Mixed Signal LP_GPIO_44</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ANALOG_ENABLE_45</name>
              <description>Active High Analog Mode Enable for Mixed Signal LP_GPIO_45</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ANALOG_ENABLE_46</name>
              <description>Active High Analog Mode Enable for Mixed Signal LP_GPIO_46</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>

            <field>
              <name>ANALOG_ENABLE_47</name>
              <description>Active High Analog Mode Enable for Mixed Signal LP_GPIO_47</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>IO_PADS_CONTROL</name>
          <description>Controls behaviour of IO Pads in Sleep Mode</description>
          <addressOffset>0x414</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>

          <fields>
            <field>
              <name>LATCH_ENABLE</name>
              <description>Active High Latch Enable of IO Pads configuration parameters. When Low, Pads retain their configured state during sleep mode.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
