JulianvDoorn/atmel-atpack-collection/samb11/svd/ATSAMB11ZR.svd
      </registers>
    </peripheral>

    <peripheral> <!-- Family = ARM_DWT :: Name = ARM_DWT0 -->
      <name>ARM_DWT0</name>
      <version>1.0.0</version>
      <description>ARM DWT Control</description>
      <groupName>ARM_DWT</groupName>
      <baseAddress>0xe0001000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>DWT_CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf0000000</resetMask>

          <fields>
            <field>
              <name>NUMCOMP</name>
              <description>Number of comparators available</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PCSR</name>
          <description>Program Counter Sample Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>EIASAMPLE</name>
              <description>Executed Instruction Address sample value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_COMP0</name>
          <description>DWT Compare Register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>COMP</name>
              <description>Reference Value for Comparison</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_MASK0</name>
          <description>DWT Mask Register 0</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>MASK_VALUE</name>
              <description>Size of the ignore mask applied to address range matching</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_FUNCTION0</name>
          <description>DWT Function Register 0</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x100000f</resetMask>

          <fields>
            <field>
              <name>FUNCTION</name>
              <description>Select action on comparator match</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>PC Watchpoint Event (Instruction)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Watchpoint Event Read Only (Data)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Watchpoint Event Write Only (Data)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Watchpoing Event Write-Read (Data)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MATCHED</name>
              <description>Comparator Match</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_COMP1</name>
          <description>DWT Compare Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffffffff</resetMask>

          <fields>
            <field>
              <name>COMP</name>
              <description>Reference Value for Comparison</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_MASK1</name>
          <description>DWT Mask Register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f</resetMask>

          <fields>
            <field>
              <name>MASK_VALUE</name>
              <description>Size of the ignore mask applied to address range matching</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_FUNCTION1</name>
          <description>DWT Function Register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x100000f</resetMask>

          <fields>
            <field>
              <name>FUNCTION</name>
              <description>Select action on comparator match</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>PC Watchpoint Event (Instruction)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Watchpoint Event Read Only (Data)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Watchpoint Event Write Only (Data)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Watchpoing Event Write-Read (Data)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <field>
              <name>MATCHED</name>
              <description>Comparator Match</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PID4</name>
          <description>Peripheral ID Register 4</description>
          <addressOffset>0xFD0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_C_CODE</name>
              <description>JEP106 C Code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>BLOCK_COUNT</name>
              <description>Block Count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PID0</name>
          <description>Peripheral ID Register 0</description>
          <addressOffset>0xFE0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 7:0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PID1</name>
          <description>Peripheral ID Register 1</description>
          <addressOffset>0xFE4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>PART_NUMBER</name>
              <description>Part Number Bits 11:8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEP106_ID_3_0</name>
              <description>JEP106 ID Code Bits 3:0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PID2</name>
          <description>Peripheral ID Register 2</description>
          <addressOffset>0xFE8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>JEP106_ID_6_4</name>
              <description>JEP106 ID Code Bits 6:4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>JEDEC_USED</name>
              <description>JEDEC Used</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>REVISION</name>
              <description>Revision</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_PID3</name>
          <description>Peripheral ID Register 3</description>
          <addressOffset>0xFEC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>

          <fields>
            <field>
              <name>CUSTOMER_MOD_NUMBER</name>
              <description>Customer Modification Number</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>

            <field>
              <name>ECO_REV_NUMBER</name>
              <description>ECO Revision Number</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>DWT_CID0</name>
          <description>Component ID Register 0</description>
          <addressOffset>0xFF0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>DWT_CID1</name>
          <description>Component ID Register 1</description>
          <addressOffset>0xFF4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xE0</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>DWT_CID2</name>
          <description>Component ID Register 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xff</resetMask>
        </register>

        <register>
          <name>DWT_CID3</name>
          <description>Component ID Register 3</description>
          <addressOffset>0xFFC</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xB1</resetValue>
          <resetMask>0xff</resetMask>
        </register>
